<template>
  <div>
    <div class="header">
      <div class="left" @click="goback"><</div>
      <div class="title">pageA</div>
    </div>
    <div>
    <router-link to="/pageB">
    离开大学校园已经有三年多的时间了，看到有很多小伙伴在大学期间做了各种有意义的事，比如旅行、做公益、写作，现在回想起来我的大学，让我最遗憾的不是谈了一场无疾而终的异地恋，也不是错过了数字可观的国家奖学金，而是说好的“等我上了大学，我要天天泡在图书馆里不能自拔，直至两耳不闻窗外事，一心只读圣贤书的境界”我没有达到。

2013年9月份正式参加工作，那时候我还在乡镇政府工作，没有万达广场、没有海底捞，下了班没有广场可逛，没有美食可享用，只好从当当上买来书，把它当精神食粮来啃。这一啃竟然上瘾了。

再后来到了现在的单位，离市里的图书馆和新华书店都不远，于是我办了张借阅卡，几乎每个周末都会去借三四本书回来看。有时间的话也会去参加读书沙龙。后来，我不满足于图书馆里的书，因为大多都比较旧，更新的很慢，所以我从我的收入里每月拿出200块钱作为给自己学习充电的经费。

三年多下来，我大体算了算我一共读了大概200多本书，包括经典、励志还有畅销书。大部分都是图书馆借来的，还有一部分是自己买的。我喜欢看书也喜欢收藏书。不过，收藏书最惨的就是我每次搬家的时候，不得不一摞一摞的搬来搬去。
</router-link>
</div>
  </div>
</template>

<script>
export default {
  name: 'pageA',
  methods: {
    goback () {
      this.$router.goBack()
    }
  }
}
</script>

